Revit 2026 API

# AnalysisDisplayDiagramSettings Class

---

Contains diagram settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayDiagramSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayDiagramSettings : IDisposable
```
```vb
Public Class AnalysisDisplayDiagramSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayDiagramSettings : IDisposable
```
```fsharp
type AnalysisDisplayDiagramSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayDiagramSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayDiagramSettings | Constructs a default instance of diagram settings. |
|  | AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) | Constructs a new copy of the input AnalysisDisplayDiagramSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | FenceType | Type of diagram fence visualization. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OutlineColor | Color of outline and fence lines in the diagram. |
|  | OutlineLineWeight | Line weight of outline and fence lines in the diagram. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in diagram. |
|  | TextLabelType | Type of diagram text label visualization. |
|  | TextTypeId | Element id of text associated with the settings. |
|  | Transparency | Transparency percentage of diagram color fill |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalysisDisplayDiagramSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Compares two diagram settings objects. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace